## Production: glue
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 10 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| add    | `aws_glue_catalog_database.operations_aws_production`          |
|        | `aws_glue_crawler.operations_aws_production_account_tags`      |
|        | `aws_glue_crawler.operations_aws_production_cost_usage_report` |
|        | `aws_glue_security_configuration.encryption_at_rest`           |
|        | `aws_iam_policy.glue_crawler`                                  |
|        | `aws_iam_role.glue_crawler`                                    |
|        | `aws_iam_role_policy_attachment.aws_glue_service_role`         |
|        | `aws_iam_role_policy_attachment.glue_crawler`                  |
|        | `aws_kms_alias.data_export`                                    |
|        | `aws_kms_key.aws_glue`                                         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.aws_glue will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "aws_glue" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "kms:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + "739275439843",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:CreateGrant",
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey",
              + "kms:GenerateDataKeyWithoutPlaintext",
              + "kms:ReEncryptFrom",
              + "kms:ReEncryptTo",
              + "kms:RetireGrant",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # data.aws_iam_policy_document.glue_crawler will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "glue_crawler" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::mock-curated-bucket/*",
              + "arn:aws:s3:::mock-raw-bucket/*",
              + "arn:aws:s3:::mock-transformed-bucket/*",
            ]
          + sid       = "ReadDataLakeS3Buckets"
        }
      + statement {
          + actions   = [
              + "kms:CreateGrant",
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey",
              + "kms:GenerateDataKeyWithoutPlaintext",
              + "kms:ReEncryptFrom",
              + "kms:ReEncryptTo",
              + "kms:RetireGrant",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "UseGlueKey"
        }
    }

  # aws_glue_catalog_database.operations_aws_production will be created
  + resource "aws_glue_catalog_database" "operations_aws_production" {
      + arn          = (known after apply)
      + catalog_id   = (known after apply)
      + description  = "Data source path: /operations/aws/*"
      + id           = (known after apply)
      + location_uri = (known after apply)
      + name         = "operations_aws_production"
      + tags_all     = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + create_table_default_permission (known after apply)
    }

  # aws_glue_crawler.operations_aws_production_account_tags will be created
  + resource "aws_glue_crawler" "operations_aws_production_account_tags" {
      + arn                    = (known after apply)
      + configuration          = jsonencode(
            {
              + CrawlerOutput        = {
                  + Tables = {
                      + TableThreshold = 1
                    }
                }
              + CreatePartitionIndex = true
              + Version              = 1
            }
        )
      + database_name          = "operations_aws_production"
      + id                     = (known after apply)
      + name                   = "Organization Account Tags"
      + role                   = (known after apply)
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "org_"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://mock-raw-bucket/operations/aws/organization"
        }
    }

  # aws_glue_crawler.operations_aws_production_cost_usage_report will be created
  + resource "aws_glue_crawler" "operations_aws_production_cost_usage_report" {
      + arn                    = (known after apply)
      + configuration          = jsonencode(
            {
              + CrawlerOutput        = {
                  + Tables = {
                      + TableThreshold = 2
                    }
                }
              + CreatePartitionIndex = true
              + Version              = 1
            }
        )
      + database_name          = "operations_aws_production"
      + id                     = (known after apply)
      + name                   = "Cost and Usage Report 2.0"
      + role                   = (known after apply)
      + security_configuration = "encryption-at-rest"
      + table_prefix           = "cost_usage_report_"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + s3_target {
          + path = "s3://mock-raw-bucket/operations/aws/cost-usage-report"
        }
    }

  # aws_glue_security_configuration.encryption_at_rest will be created
  + resource "aws_glue_security_configuration" "encryption_at_rest" {
      + id   = (known after apply)
      + name = "encryption-at-rest"

      + encryption_configuration {
          + cloudwatch_encryption {
              + cloudwatch_encryption_mode = "SSE-KMS"
              + kms_key_arn                = (known after apply)
            }
          + job_bookmarks_encryption {
              + job_bookmarks_encryption_mode = "CSE-KMS"
              + kms_key_arn                   = (known after apply)
            }
          + s3_encryption {
              + s3_encryption_mode = "SSE-S3"
            }
        }
    }

  # aws_iam_policy.glue_crawler will be created
  + resource "aws_iam_policy" "glue_crawler" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "AWSGlueCrawler-DataLake"
      + name_prefix      = (known after apply)
      + path             = "/service-role/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.glue_crawler will be created
  + resource "aws_iam_role" "glue_crawler" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "AWSGlueCrawler-DataLake"
      + name_prefix           = (known after apply)
      + path                  = "/service-role/"
      + tags_all              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.aws_glue_service_role will be created
  + resource "aws_iam_role_policy_attachment" "aws_glue_service_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"
      + role       = "AWSGlueCrawler-DataLake"
    }

  # aws_iam_role_policy_attachment.glue_crawler will be created
  + resource "aws_iam_role_policy_attachment" "glue_crawler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "AWSGlueCrawler-DataLake"
    }

  # aws_kms_alias.data_export will be created
  + resource "aws_kms_alias" "data_export" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/aws-glue"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.aws_glue will be created
  + resource "aws_kms_key" "aws_glue" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "AWS Glue encryption key for data at rest"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.aws_glue"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
